В Базе Данных (инструкция по доступу) есть таблица ROSSTAT_SALARY_RU, в которой содержатся сведения о средней 
заработной плате в РФ по регионам на 1 января 2019 года по данным Росстата. Представим ситуацию, что из-за невнимательности операциониста, 
регионы: Республика Татарстан, Республика Марий Эл оказались не представлены в итоговой сводке. Роль невнимательного операциониста придется 
исполнить Вам (т.е. нужно удалить соответствующие строки), а далее работать уже с новой выборкой.
Выполните задание используя Azure ML Studio или с помощью Python.
Постройте вариационный ряд (сортировка по неубыванию, нумерация элементов начинается с ).

Введите : Х_(21),Х_(22),Х_(77),
 
Найдите выборочное среднее:
Ответ округлите до сотых.
 
Определите выборочную медиану:

БД
https://anydesk.com/ru
Workspace: online_ru 
Username: itmo 
Password: online
 