def solve(a, b):
    pass


# comment
# Набор данных pulsar_stars  содержит сведения о звездах, полученные в ходе исследовании вселенной (High Time Resolution Universe Survey)
# с целью определения одного из типа нейтронных звезд — пульсаров. Всего 17898 наблюдений, среди них 1639 — пульсары. 
# По каждому наблюдению доступно 8 непрерывных предикторов: среднее значение интегрального профиля; 
# стандартное отклонение интегрального профиля; избыточный эксцесс интегрального профиля; асимметрия интегрального профиля; 
# среднее значение кривой DM-SNR; стандартное отклонение кривой DM-SNR; избыточный эксцесс кривой DM-SNR; 
# асимметрия кривой DM-SNR и бинарный отклик. 
# Задание
# 1. Получите выборку из набора данных pulsar_stars на основании следующих критериев:
# Все строки, где  TARGET(TG) = 0 и MIP пренадлежит  [104.1953125, 104.5859375]
# И все строки, где TARGET(TG) = 1 и MIP пренадлежит [5.8125, 14.1484375]

# Укажите число строк в полученной выборке:
# Определите выборочное среднее для столбца MIP:
# Введите ответ с точностью до трех знаков.

